[
    {
        "id": "freelance2",
        "jobPicture": "freelance.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Full Stack Web Developer",
        "jobTime": "February 2025 - April 2025",
        "jobCompany": "Freelance",
        "jobDescription": "Contributed to the development of a full-stack e-commerce platform, leading backend implementation while also integrating frontend features like authentication and cart logic using Next.js and Redux Toolkit.",
        "jobActivities": [
            "Built and deployed the backend for an e-commerce platform using Express.js, TypeScript, and MongoDB, with features like product, order, user, and coupon management, PDF invoice generation, and PayPal Checkout integration.",
            "Implemented secure authentication using Google OAuth with token-based cookies, and configured deployment to ensure proper cookie handling between frontend and backend.",
            "Implemented email notification features and configured DNS records to support reliable SMTP delivery using GoDaddy as the email provider for account verification and order updates.",
            "Contributed to the frontend using Next.js, JavaScript, and Redux Toolkit, integrating backend functionality and assisting with UI implementation using shadcn components."
        ],
        "jobTechnologies": [
            { "name": "TypeScript", "icon": "typescript" },
            { "name": "Node.js", "icon": "node" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "Express.js", "icon": "express" },
            { "name": "Vercel", "icon": "vercel" },
            { "name": "Next.js", "icon": "nextjs" },
            { "name": "Tailwind", "icon": "tailwind" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "Docker", "icon": "docker" }
        ]
    },
    {
        "id": "freelance1",
        "jobPicture": "freelance.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Full Stack Web Developer",
        "jobTime": "June 2024 - September 2024",
        "jobCompany": "Freelance",
        "jobDescription": "Contributed to a full-stack web application for a car servicing business, leading backend development on a serverless platform while implementing authentication, email notifications with DNS setup, and supporting frontend integration.",
        "jobActivities": [
            "Developed and deployed the backend of a car servicing app using Express.js, Javascript, and MongoDB, including booking logic, client management, email notifications, and PDF generation for quotations and invoices.",
            "Implemented a complete authentication flow including login, signup, email verification, and password reset, using token-based auth.",
            "Contributed to the frontend using Next.js, Javascript, and shadcn, integrating backend endpoints and assisting with UI implementation.",
            "Delivered a reliable, production-ready application that continues to serve real business operations today."
        ],
        "jobTechnologies": [
            { "name": "Express.js", "icon": "express" },
            { "name": "React.js", "icon": "react" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "JavaScript", "icon": "javascript" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "Docker", "icon": "docker" }
        ]
    },
    {
        "id": "internship-cleaningly",
        "jobPicture": "cleaningly.jpg",
        "jobColor": "#0086eb",
        "jobTitle": "Web Developer Intern",
        "jobTime": "September 2023 - December 2023",
        "jobCompany": "Cleaningly",
        "jobDescription": "Contributed to the development and maintenance of multiple web applications, focusing on implementing new features, resolving bugs, and ensuring seamless frontend integrations.",
        "jobActivities": [
            "Built and maintained web application features using the MERN stack.",
            "Resolved API data integrity issues, improving data accuracy for client appointment statistics.",
            "Completed over 20 development tickets, including bug fixes and feature implementations.",
            "Collaborated with team members to ensure timely delivery of deliverables."
        ],
        "jobTechnologies": [
            { "name": "Next.js", "icon": "nextjs" },
            { "name": "React.js", "icon": "react" },
            { "name": "Material UI", "icon": "materialui" },
            { "name": "Express.js", "icon": "express" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "TypeScript", "icon": "typescript" },
            { "name": "Node.js", "icon": "node" },
            { "name": "Yarn", "icon": "yarn" }
        ]
    }
]