[
    {
        "id": "freelance2",
        "jobPicture": "freelance.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Full Stack Web Developer",
        "jobTime": "February 2025 - April 2025",
        "jobCompany": "Freelance",
        "jobDescription": "Contributed to the development of a full-stack e-commerce platform, leading backend implementation while also integrating frontend features like authentication and cart logic using Next.js and Redux Toolkit.",
        "jobActivities": [
            "Built and deployed the backend for an e-commerce platform using Express.js, TypeScript, and MongoDB, with features like product/order/user management, PDF generation, and third-party integrations.",
            "Implemented email notifications using SMTP and configured domain DNS records to ensure proper email delivery.",
            "Designed and implemented secure cookie-based authentication, and ensured correct deployment config for cookie handling between frontend/backend domains.",
            "Integrated key front-end features such as cart management using Redux Toolkit, with data validation and fallback logic to handle tampering or stock limit breaches.",
            "Handled auth integration on the Next.js frontend, collaborating with frontend team and working with shadcn and Tailwind CSS components."
        ],
        "jobTechnologies": [
            { "name": "TypeScript", "icon": "typescript" },
            { "name": "Node.js", "icon": "node" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "Express.js", "icon": "express" },
            { "name": "Vercel", "icon": "vercel" },
            { "name": "Next.js", "icon": "nextjs" },
            { "name": "Tailwind", "icon": "tailwind" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "Docker", "icon": "docker" }
        ]
    },
    {
        "id": "freelance1",
        "jobPicture": "freelance.webp",
        "jobColor": "#0086eb",
        "jobTitle": "Full Stack Web Developer",
        "jobTime": "June 2024 - September 2024",
        "jobCompany": "Freelance",
        "jobDescription": "Contributed to a full-stack web application for a car servicing business, leading backend development on a serverless platform while implementing authentication, email notifications with DNS setup, and supporting frontend integration.",
        "jobActivities": [
            "Developed and deployed a scalable RESTful API on a serverless platform (Express.js + MongoDB) for a car servicing business in Singapore.",
            "Created email notification system and managed SMTP and DNS configuration to support email-based authentication and service reminders/updates.",
            "Implemented and integrated full authentication flow with token-based auth via local storage, including login, signup, and email verification functionality",
            "Worked directly with a front-end developer to integrate and test API endpoints, ensuring reliable data transfer.",
            "Delivered a reliable, production-ready application that continues to serve real business operations today."
        ],
        "jobTechnologies": [
            { "name": "Express.js", "icon": "express" },
            { "name": "React.js", "icon": "react" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "JavaScript", "icon": "javascript" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "Docker", "icon": "docker" }
        ]
    },
    {
        "id": "internship-cleaningly",
        "jobPicture": "cleaningly.jpg",
        "jobColor": "#0086eb",
        "jobTitle": "Web Developer Intern",
        "jobTime": "September 2023 - December 2023",
        "jobCompany": "Cleaningly",
        "jobDescription": "Contributed to the development and maintenance of multiple web applications, focusing on implementing new features, resolving bugs, and ensuring seamless frontend integrations.",
        "jobActivities": [
            "Built and maintained web application features using the MERN stack.",
            "Resolved API data integrity issues, improving data accuracy for client appointment statistics.",
            "Completed over 20 development tickets, including bug fixes and feature implementations.",
            "Collaborated with team members to ensure timely delivery of deliverables."
        ],
        "jobTechnologies": [
            { "name": "Next.js", "icon": "nextjs" },
            { "name": "React.js", "icon": "react" },
            { "name": "Material UI", "icon": "materialui" },
            { "name": "Express.js", "icon": "express" },
            { "name": "MongoDB", "icon": "mongodb" },
            { "name": "Git/Github", "icon": "github" },
            { "name": "TypeScript", "icon": "typescript" },
            { "name": "Node.js", "icon": "node" },
            { "name": "Yarn", "icon": "yarn" }
        ]
    }
]